"use strict";

// Таблица умножения
// Домашнее задание
// ● Условие
// На вход подается число n.
// ● Задача
// Написать скрипт в любой парадигме, который выводит на экран таблицу умножения всех чисел от 1 до n.
// Обоснуйте выбор парадигм

const n = 15;

for (let i = 1; i <= n; i++) {
  console.log(`1 * ${i} = ${i}`);
}

// Структурная парадигма. Используется цикл и обьявления, нет goto. 

// Процедурная в этом случае не нужна, потому что по условию задачи нам нужно вывести таблицу только один раз,
// значит мы не будем переиспользовать код, значит оборачивать его в процедуру нет смысла. 